Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལྟར་ཤིན་ཏུ་བརྩམས་པ་ནི་སེམས་ཅན་རྣམས་ལ་ཚད་མེད་པས་གནས་པའི་རྒྱུ་མཐུན་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཤེགས་པ་དག་གིས་མངོན་པར་ཤེས་པ་ལ་གནས་པའི་རྒྱུ་མཐུན་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་མདོ་གཞན་དག་ལས་རྒྱུ་མཐུན་པའི་ཡོན་ཏན་བསྟན་པ་རྣམས་སྟོན་ཏེ།
en: Really fully carried out” teaches “the concordant cause that is remaining on account of the immeasurables for beings, and the concordant cause that is standing in the clairvoyances by those who travel to buddhafields” and so on—the good qualities that are the concordant causes taught in other sūtras.

source: དེ་ལ་བྱམས་པའི་རྒྱུ་མཐུན་པ་ནི། བཞིན་འཛུམ་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་སྟེ། འདི་ནི་ངེས་པར་སྤྱོད་པ་ལ་ཞུགས་པ་རྣམས་ཀྱི་ཆོས་ཉིད་དེ་ཚེ་རབས་ཚེ་རབས་སུ་བཞིན་འཛུམ་པ་དང་ལྡན་པ་ཉིད་དུ་འགྱུར་རོ།
en: Among these, in regard to the concordant cause that is love, it says they are with smiling countenances because it is in the nature of things that those who have entered into the certain course of conduct have smiling faces in lifetime after lifetime.

source: །འདི་ལྟ་སྟེ་སེམས་ཅན་མི་བསྲུན་པ་རྣམས་དགའ་ཞིང་ཡིད་རྟོན་པར་བྱ་བའི་ཕྱིར། གནས་སྐབས་ཐམས་ཅད་དུ་ནམ་ཡང་བཞིན་འགྱུར་བ་མི་འབྱུང་ངོ་།
en: That is, in order that undisciplined beings will believe in them their countenances never ever change.

source: །སྙིང་རྗེའི་རྒྱུ་མཐུན་པ་བསྟན་པའི་ཕྱིར། གསོང་པོར་སྨྲ་བ་ཞེས་བྱ་བ་གསུངས་སོ།
en: To teach the concordant cause that is compassion it says they are forward in addressing others.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་གློ་བུར་དུ་འོངས་པ་མ་འདྲིས་པ་ལ་ཡང་བདག་ཉིད་ཀྱིས་ཀུན་དགའ་བའི་གཏམ་གྱིས་བསྡུ་བ་སྔར་སྟོན་གྱི་ཕྱིས་ནི་མ་ཡིན་ནོ།
en: Bodhisattvas go out of their way to greet even nonacquaintances who turn up unexpectedly, before, not afterward, to make them feel at ease.

source: །རབ་ཏུ་དགའ་བའི་རྒྱུ་མཐུན་པ་བསྟན་པའི་ཕྱིར་བཞིན་ཁྲོ་གཉེར་མེད་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: To teach the concordant cause that is joy it says they are without a frown on their faces.

source: །འདི་ནི་ཆོས་ཉིད་དེ་གང་གི་བཞིན་ཁྲོ་གཉེར་ཅན་དུ་འགྱུར་བ་དེ་ལྟ་བུའི་ཡིད་མི་བདེ་བ་མེད་དོ།
en: It is in the nature of things that they do not feel the kind of irritation that makes them frown, no matter what happens.

source: །བརྩོན་འགྲུས་བརྩམས་པ་ལ་སྐྱོ་བར་འགྱུར་བ་དེ་ལྟ་བུ་མེད་དོ།
en: When making an effort they do not get upset like that.

source: །གཞན་དག་ལ་མི་བཟོད་པར་འགྱུར་བ་དེ་ལྟ་བུ་མེད་དོ། །དེ་ལྟ་བུའི་ཡིད་འཁྲུག་པ་མི་སྐྱེད་དོ།
en: They do not become impatient like that with others; they do not get disturbed.

source: །ད་ནི་ཕ་རོལ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བརྗོད་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཤེགས་པ་དག་གིས་མངོན་པར་ཤེས་པའི་རྒྱུ་མཐུན་པའི་ཡོན་ཏན་རྣམས་སྟོན་ཏེ།
en: Now, with skillful in communicating with others in chanted verse and so on, it teaches the good quality of the concordant cause that is the clairvoyances of those who travel to buddhafields.

source: བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཤེགས་པ་ན་ལམ་གྱི་བར་དུ་བདག་ཉིད་དམ། སྤྲུལ་པས་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་གཞན་དག་ལ་ཆོས་སྟོན་ཅིང་ཡང་དག་པར་བསྐུལ་ལོ།
en: When bodhisattvas travel to buddhafields, along the way, either in their own form or in a magically created form, they teach and inspire others with the Dharma by chanting it in verse.

source: །དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་བྱོན་ནས་ཀྱང་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བསྟོད་པ་དང་། དྲིས་པའི་ལན་ལྡོན་ཏེ།
en: Furthermore, having come into the presence of the tathāgatas they chant praises of them in verse and respond to their questions in verse.

source: འདིས་ནི་ངག་རྣམ་པར་དག་པ་ཐོབ་པར་སྟོན་ཏོ།
en: This demonstrates that they have attained perfect speech.

source: །སེམས་རྣམ་པར་དག་པ་ཐོབ་པར་བསྟན་པའི་ཕྱིར་སེམས་ཞུམ་པ་མེད་པ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To teach that they have attained perfect thought it says without feelings of depression.

source: ས་འོག་མ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་ནི་ཚོགས་ཡོངས་སུ་མ་རྫོགས་པ་དང་། ཡིད་ལ་བྱེད་པ་རྟོག་པ་དང་བཅས་པའི་ཕྱིར་ཡོན་ཏན་གྱི་ལག་པས་གོང་མ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱན་སྔར་ཞུམ་པའི་སེམས་སྐྱེའི་འདི་དག་ནི་ཚེ་ལ་དབང་བ་དང་། སེམས་ལ་དབང་བ་དང་། ཡོ་བྱད་ལ་དབང་བ་དང་། ལས་ལ་དབང་བ་དང་། སྐྱེ་བ་ལ་དབང་བ་དང་། སྨོན་ལམ་ལ་དབང་བ་དང་།
en: This is to teach that some bodhisattvas stationed on lower levels who have not completed the accumulations, and still have thought constructions when they pay attention, feel depressed in the presence of bodhisattvas stationed on higher levels and by tathāgatas, because their qualities are superior.

source: མོས་པ་ལ་དབང་བ་དང་། རྫུ་འཕྲུལ་ལ་དབང་བ་དང་། ཡེ་ཤེས་ལ་དབང་བ་དང་། ཆོས་ལ་དབང་བ་དང་། ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་དབང་བཅུ་པོ་དེ་རྣམས་ཐོབ་པས་དུས་ཐམས་ཅད་དུ་སེམས་ལ་ཞུམ་པའི་སེམས་མེད་པར་བསྟན་པའི་ཕྱིར།
en: These, however, gain ten controls over lifespan, mind, necessities, action, birth, prayer, belief, the miraculous powers, knowledge, Dharma, and absolute purity, and never have thoughts that feel depressed.

source: སེམས་ཞུམ་པ་མེད་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Thus it says “without feelings of depression.”

source: །ཡང་དག་པར་རིག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་པར་བསྟན་པའི་ཕྱིར། སྤོབས་པ་མི་ཆོད་པ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To teach the matured four detailed and thorough knowledges obtained by those with correct understanding it says without losing the confidence giving a readiness to speak.

source: དེ་བས་ན་འདི་ནི་ཆོས་སྨྲ་བ་ཆེན་པོ་ཡིན་པར་བརྗོད་དེ། ཇི་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའི་ས་བློ་གྲོས་ལེགས་པ་ཞེས་བྱ་བ་འདི་ལ་གནས་པ་དེ་ནི་ཆོས་སྨྲ་བ་ཆེན་པོ་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་མཛོད་ཀྱང་སྲུང་ངོ་།
en: Therefore, as it is said, they are great Dharma preachers: Stationed on the Sādhumatī level, bodhisattvas act as great Dharma preachers, guarding the Dharma treasury of the tathāgatas.

source: །ཆོས་སྨྲ་བའི་གོ་འཕང་ཐོབ་པ་དེ་ཡེ་ཤེས་ལ་མཁས་པ་ཚད་མེད་པ་དང་ལྡན་པས་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་པོ་དག་གིས་མངོན་པར་བསྒྲུབས་པའི་ཚིག་གིས་ཆོས་སྟོན་ཏེ།
en: Having reached the rank of a Dharma preacher, in possession of an immeasurable skill in knowledge they teach the Dharma with words produced by the four detailed and thorough knowledges.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སོ་སོ་ཡང་དག་པར་རིག་པ་མ་འདྲེས་པ་བཞི་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་འབྱུང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལྟ་བུའོ།
en: The four unbroken detailed and thorough knowledges are continuously and always operating in them. And so on.

source: །དབྱངས་ཀྱི་ཡན་ལག་གྲངས་མེད་པ་འབུམ་ཕྲག་བཅུ་དང་ལྡན་པ་ལ་མཁས་པ་དང་། སྤོབས་པའི་རྣམ་པར་དབྱེ་བའི་སྒོ་ཚད་མེད་པ་དང་ལྡན་པའི་བར་གྱིས་ཆོས་སྟོན་ཏོ་ཞེས་ཀྱང་གསུངས་ཏེ། དེའི་ཕྱིར་སྤོབས་པ་མི་ཆོད་པ་ཞེས་བྱ་བ་གསུངས་སོ། །འཁོར་གྱི་ནང་དུ་འགྲོ་བ་ལ་མཁས་པ་ཐོབ་པར་བསྟན་པའི་ཕྱིར། འཁོར་མཐའ་ཡས་པ་ཟིལ་གྱིས་གནོན་པའི་མི་འཇིགས་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་གསུངས་སོ། །འདི་ལྟར་ས་བཅུ་པའི་མདོ་ལས་གསུངས་པའི་རིམ་པས་རྫུ་འཕྲུལ་བྱ་བ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། ཡེ་ཤེས་ལ་མཁས་པ་ཚད་མེད་པ་དང་།
en: It also says, They teach the Dharma in a skillful voice that is endowed with a million immeasurable special properties, up to through the immeasurable doors of the divisions of the confidence giving a readiness to speak.

source: སྤོབས་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། འོད་ཟེར་བཀོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་།
en: Thus it says “without losing the confidence giving a readiness to speak.”

source: དྲིས་པའི་ལན་ལྡོན་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། དབྱངས་ཀྱི་ཡན་ལག་བརྗོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། ཆོས་བསྟན་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། གསང་བ་སྤྱོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་།
en: To teach that they have gained the skill of going into assemblies, it says they are endowed with fearlessness when surpassing endless assemblies.

source: ཆོས་ཀྱི་སྒོ་རྣམ་པར་དབྱེ་བ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། ཆོ་འཕྲུལ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། དབང་ལ་མཁས་པ་ཚད་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་བྱིན་གྱིས་བརླབས་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་སྤྱོད་པ་བརྗོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། སེམས་ཅན་གྱི་ཁམས་བརྗོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། གདུལ་བའི་ཁམས་བརྗོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། ཆོས་ཀྱི་དབྱིངས་བརྗོད་པ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བ་ལ་མཁས་པ་ཚད་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ཐམས་ཅད་དུ་འཇུག་པར་བྱ་བ་ལ་མཁས་པ་ཚད་མེད་པ་དང་།
en: Thus, following the order in The Ten Bhūmis, there is an immeasurable skill in the workings of miraculous power, immeasurable skill in knowledge, immeasurable skill in confidence giving a readiness to speak, immeasurable skill in the manifestation of light rays, immeasurable skill in providing answers to questions, immeasurable skill in speaking in a voice with special properties, immeasurable skill in teaching the Dharma, immeasurable skill in the meditative stabilizations and dhāraṇī doors, immeasurable skill in a secret course of conduct, immeasurable skill in the divisions of the doors of the Dharma, immeasurable skill in miracles, immeasurable skill in the ten controls, immeasurable skill in objects under a buddha’s controlling power, immeasurable skill in speaking about practices on the side of awakening, immeasurable skill in speaking about world systems, immeasurable skill in speaking about the mass of beings, immeasurable skill in speaking about the mass of those to be trained, immeasurable skill in speaking about the dharma-constituent, immeasurable skill in purifying buddhafields, and immeasurable skill in all objects within the range of the buddhas that they should enter into.

source: མཁས་པ་རྣམ་པ་ཉི་ཤུ་པོ་འདི་དག་ལ་ཤིན་ཏུ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འཁོར་གང་དང་གང་དུ་འགྲོ་བ་དེ་ཐམས་ཅད་དུ་བག་ཚ་བ་ཐམས་ཅད་མེད་དེ། སེང་གེ་དང་། ཚངས་པ་དང་། དེ་བཞིན་གཤེགས་པ་དང་། ནམ་མཁའ་བཞིན་དུ་འཇིགས་པ་མེད་པ་དང་། བསྙེམས་པ་དང་བཅས་པ་དང་། ཁྱུ་མཆོག་ཏུ་གྱུར་པ་དང་། གང་དུ་ཡང་ཆགས་པ་མེད་པ་དང་བདུན་དུ་བྱས་ཏེ་འགྲོ་བར་འགྱུར་རོ།
en: Bodhisattvas extremely skilled in these twenty skills do not get anxious whatever the assembly they go into, proceeding as the seven: as lions, brahmins, and tathāgatas; fearless like the sky; with confidence; as the dominant bull; and without attachment to anything.

source: །དེ་ལ་སུས་ཀྱང་ཟིལ་གྱིས་མི་ནོན་ལ། བདག་གིས་ནི་གང་ཡང་ཟིལ་གྱིས་མི་ནོན་པ་མེད་དེ། དེའི་ཕྱིར་འཁོར་མཐའ་ཡས་པ་ཟིལ་གྱིས་ནོན་པའི་མི་འཇིགས་པ་དང་ལྡན་པ་ཞེས་གསུངས་སོ།
en: No one eclipses them, and there is no one whom they do not eclipse, so it says of them that they are “endowed with fearlessness when surpassing endless assemblies.”

source: །བསྐལ་པ་བྱེ་བ་མཐའ་ཡས་པས་ངེས་པར་འབྱུང་བ་ལ་མཁས་པ་ཞེས་བྱ་བ་འདིས་ནི་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་གྱུར་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་བསྟན་ཏེ།
en: It says they are skilled in going forth during an ananta of one hundred million eons. This teaches the concordant cause that is the perfection of perseverance in its matured form.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྣམ་པར་སྨིན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པས་བྱ་དཀའ་བ་ཐམས་ཅད་ལ་བྱ་དཀའ་བའི་འདུ་ཤེས་མི་བསྐྱེད་དོ།
en: Thus, bodhisattvas who have gained the matured perfection of perseverance do not entertain the idea that what is difficult to do is indeed difficult to do.

source: །སེམས་ཅན་ལ་ཕན་པ་བྱ་བ་དག་ལ་ཡོངས་སུ་གདུང་བ་མི་འབྱུང་ངོ་།
en: They do not feel oppressed by what is beneficial for beings.

source: །དེ་བརྩོན་འགྲུས་ཤིན་ཏུ་ཆེར་བརྩམས་པས་འབད་པ་ན། བསྐལ་པ་མང་པོ་ཡང་འདའ་བར་འགྱུར་བ་ནས། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་བར་དག་ཀྱང་འདའ་བར་འགྱུར་ཏེ། ཇི་སྐད་དུ་བདག་ཅག་གི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན། སངས་རྒྱས་སྐར་རྒྱལ་ཞེས་བྱ་བ་མཉེས་པར་བྱེད་པ་ན་བསྐལ་པ་དགུ་འདས་པར་གྱུར་ཏོ་ཞེས་འབྱུང་བ་ལྟ་བུ་སྟེ།
en: While they strive and make an extremely great vigorous attempt many eons pass, up to a hundred thousand million billion eons pass, as in the statement, “When our Lord Śākyamuni was a bodhisattva he passed nine eons serving the buddha called Puṣya.”

source: དེ་ལྟར་ཤིན་ཏུ་བརྩོན་པ་ཆེན་པོས་འདའ་བར་བྱས་ནས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་རྣམས་ནི་འདའ་བར་འགྱུར་གྱི། བསྐལ་པ་གྲངས་མེད་པ་ལས་ནི་སུས་ཀྱང་འདའ་བར་མི་འགྱུར་རོ།
en: Thus, while making an extremely great effort a hundred thousand million billion eons pass, but no one can go beyond an asaṃkhyeya of eons.

source: །དེ་བས་ན་བསྐལ་པ་བྱེ་བ་མཐའ་ཡས་པས་ངེས་པར་འབྱུང་བ་ལ་མཁས་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Hence it says they are “skilled in going forth during an ananta of one hundred million eons.”

source: །དེ་ལྟར་འདི་དག་གིས་སྤྱོད་པ་ངེས་པ་ལ་སྦྱོར་བའི་ཡོན་ཏན་བསྟན་ནས།
en: It teaches these good qualities of the practice of the certain course of conduct in that way.

source: གོང་དུ་མཐར་ཐུག་པར་འགྲོ་བའི་སའི་ཡོན་ཏན་བསྟན་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་། རྨི་ལམ་དང་།
en: In order to teach the supreme qualities of the level above, it says they are understanding phenomena to be like an illusion, a mirage, a reflection of the moon in water, a dream, an echo, an apparition, a reflection in the mirror, and a magical creation.

source: བྲག་ཅ་དང་། མིག་ཡོར་དང་། གཟུགས་བརྙན་དང་། སྤྲུལ་པ་ལྟ་བུར་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བ་གསུངས་ཏེ། འདིས་ནི་རྣམ་པར་སྨིན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པར་གྱུར་པ།
en: This teaches that they have gained the sarva­dharma­pravicaya meditative stabilization, the concordant cause that is the matured perfection of wisdom.

source: ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་བསྟན་ཏོ། །འདི་ལྟར་སྒྱུ་མ་ལ་སོགས་པ་ནི་ཤིན་ཏུ་མེད་ཀྱང་དམིགས་པར་འགྱུར་བ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་བར་རྟོགས་པའི་ཕྱིར་རོ།
en: Thus, they have realized that just as illusions and so on are totally nonexistent, yet can be apprehended, similarly all phenomena are just like that.

source: །གདུལ་བ་རྣམས་ཀྱི་མོས་པ་དང་། བསམ་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཕྱིར་ལ་ལ་ལ་གང་གྲགས་པའམ། དོགས་པ་རྣམ་པ་བརྒྱད་བརྩལ་བའི་ཕྱིར། དཔེ་རྣམ་པ་བརྒྱད་བསྟན་ཏེ།
en: Since trainees have a variety of beliefs and aspirations it teaches with eight illustrations that are numbered relative to certain people, or in order to eliminate eight doubts.

source: འདི་ལྟར་ཆོས་རྣམས་མེད་པ་ཡིན་དུ་ཟིན་ན། དབྱིབས་ལ་སོགས་པའི་དབང་གིས་ཇི་ལྟར་དམིགས་པར་འགྱུར། དམིགས་སུ་མེད་པར་ཆོས་རྣམས་ལ་དམིགས་ནས་སེམས་དང་སེམས་ལས་བྱུང་བ་རྣམས་ཇི་ལྟར་འབྱུང་། ཆོས་རྣམས་ཡོད་པ་མ་ཡིན་ན།
en: However, there is a qualm: If you have taken phenomena to be nonexistent, how could you apprehend them through the power of their shapes and so on; and having apprehended phenomena that are not apprehendable, how could minds and mental factors come about?

source: ཇི་ལྟར་སྐྱེ་བ་དང་འཇིག་པར་སྣང་། ཆོས་རྣམས་མེད་ན་ཇི་ལྟར་བཟའ་བ་དང་། བཏུང་བ་དང་། སྦྱིན་པ་དང་། ལེན་པ་དང་།
en: If phenomena do not exist, how could they appear to arise and disintegrate?

source: བདེ་བ་དང་། སྡུག་བསྔལ་ལ་སོགས་པའི་ཐ་སྙད་འདོགས་པར་འགྱུར། ཇི་ལྟར་ན་མིང་གི་ཚོགས་དང་། ཚིག་གི་ཚོགས་ལ་སོགས་པར་འགྱུར། ཇི་ལྟར་ན་རྒྱུ་དང་རྐྱེན་ལས་འབྱུང་བར་འགྱུར། ཇི་ལྟར་ན་འབྲས་བུའི་ཆོས་རྣམས་རྒྱུ་དང་འདྲ་བར་འགྱུར།
en: If phenomena are nonexistent, how do the conventions of eating, drinking, giving, receiving, happiness, suffering, and so on become accepted; how could a collection of words and a collection of sentences and so on come about; how could things come about from causes and conditions; how could resultant features similar to the causes come about; and how could the activities of going and coming and so on come about?

source: ཇི་ལྟར་ན་འགྲོ་བ་དང་འོང་བ་ལ་སོགས་པའི་བྱེད་པ་འབྱུང་སྙམ་དུ་དོགས་པ་ལ། ཆོས་རྣམས་མེད་ན་ཇི་ལྟར་དབྱིབས་ལ་སོགས་པ་ཞེས་བྱ་བ་འདི་ལ། སྒྱུ་མའི་དཔེ་སྟེ། དཔེར་ན་སྒྱུ་མ་མཁན་གྱི་མིས་སྒྱུ་མའི་གླང་པོ་ཆེའི་ཚོགས་དང་། རྟའི་ཚོགས་དང་།
en: The illusion illustration is for this: “If phenomena are nonexistent how could there be shapes and so on?”

source: ཤིང་རྟ་དང་། དཔུང་བུ་ཆུང་དང་། རི་དང་། བཟའ་བ་དང་། བཏུང་བ་ལ་སོགས་པ་དབྱིབས་ཀྱི་དབང་གིས་སྟོན་ཀྱང་།
en: To illustrate, just as a magician makes a show of a herd of elephants, a herd of horses, chariots, and infantry, mountains, food and drink and so on through the power of shapes, even though they do not actually exist, similarly with all phenomena.

source: དེ་དག་དངོས་སུ་ཡོད་པ་མ་ཡིན་ཏེ། ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ། །ཇི་ལྟར་ན་སེམས་དང་སེམས་ལས་བྱུང་བ་རྣམས་དེ་དག་ལ་དམིགས་ནས་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: But how do the minds and mental factors that apprehend those come about?

source: དཔེར་ན་སྨིག་རྒྱུ་ལ་དམིགས་ནས། སེམས་ཅན་རྣམས་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བ་ཕྱིན་ཅི་ལོག་ཏུ་འཇུག་པ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ།
en: To illustrate, just as mistaken minds and mental factors operate when beings apprehend a mirage, similarly with all phenomena.

source: །ཇི་ལྟར་ན་སྐྱེ་བ་དང་། འཇིག་པར་འགྱུར་ཞེ་ན།
en: But how do they arise and disintegrate?

source: འདི་ལ་ཉེས་པ་མེད་དེ། ཆོས་ཐམས་ཅད་ལ་སྐྱེ་བ་དང་། འགག་པ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་ཏེ།
en: This poses no problem, because all phenomena are unproduced and unceasing.

source: དཔེར་ན་ནམ་མཁའ་ལ་ཟླ་བ་སྣང་བ་ན། ཆུ་ཟླ་ཡང་སྣང་བར་འགྱུར་ལ། མི་སྣང་ན་མི་སྣང་བར་འགྱུར་ཡང་། དངོས་པོའི་བདག་ཉིད་དུ་དེ་གང་ཡང་མེད་པ་དེ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱང་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པའི་བག་ཆགས་འབྱུང་ན་ནི་སྣང་ལ།
en: To illustrate, just as there is the appearance of a reflection of the moon in water when the moon appears in the sky, and just as there is no appearance when it does not appear, even though it has no actual reality at all, similarly with all phenomena that appear when there are residual impressions left by the imagination of the unreal.

source: མ་བྱུང་ན་མི་སྣང་བ་དེའི་ཕྱིར། ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་ཅིང་འགག་པ་མེད་དོ།
en: They do not appear when they are not there, and hence are all unproduced and unceasing.

source: །ཇི་ལྟར་འཇིག་རྟེན་གྱི་ཐ་སྙད་འབྱུང་བར་འགྱུར་ཞེ་ན། དཔེར་ན་རྨི་ལམ་ན་བཟའ་བ་དང་། བཏུང་བ་དང་།
en: How do ordinary conventions come about?

source: བགོ་བ་དང་། སྦྱིན་པ་དང་། ལེན་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་བ་ལ་སོགས་པ་སྣང་ཡང་དོན་དམ་པར་མི་དམིགས་པ་ལྟར་ཐ་སྙད་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ།
en: To illustrate, just as eating, drinking, dressing, giving, receiving, happiness, suffering, and so on appear in a dream without ultimately being apprehended, similarly with all conventions.

source: །ཇི་ལྟར་ན་མིང་གི་ཚོགས་རྣམས་དང་། ཚིག་གི་ཚོགས་རྣམས་སུ་འགྱུར་ཞེ་ན།
en: How do collections of words and collections of sentences come about?

source: དཔེར་ན་བྲག་ཅ་ལ་སྒྲའི་དངོས་པོ་མེད་ཀྱང་། རི་དང་གཅོང་རོང་སྨྲ་བ་མེད་པ་ལས་སྒྲར་དམིགས་པ་ལྟར་ཚིག་རྣམས་འཇུག་པ་ཡང་དེ་བཞིན་ནོ།
en: To illustrate, an echo has no essential reality as a sound, but just as one apprehends sounds from mountains and ravines that do not speak, similarly with the issuing forth of language.

source: །ཇི་ལྟར་ན་རྒྱུ་དང་རྐྱེན་རྣམས་ལས་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: How do things come about from causes and conditions?

source: དཔེར་ན་དབང་པོ་ཉམས་པས་སྐྲ་ཤད་འཛིངས་པ་མེད་པ་ལས་སྣང་བ་དང་། ཡུལ་གྱི་ཁྱད་པར་ལས་དྲི་ཟའི་གྲོང་ཁྱེར་ལ་སོགས་པ་དང་། བསྒོམས་པའི་ཁྱད་པར་གྱིས་ཟད་པར་ལ་སོགས་པའི་མཚན་མར་སྣང་བ་དང་། འདོད་ཆགས་དང་། མྱ་ངན་དང་།
en: To illustrate, when the sense faculty is harmed, even though there are no matted falling hairs, they appear; from a place with certain particular features the city of the gandharvas and so on appears; because of the special features of a meditation the signs of extinction and so on appear; and because of the special features of thought constructions overcome by desire, sorrow, fear, and so on there are the particular appearances of conceptualized forms and so on.

source: འཇིགས་པ་ལ་སོགས་པས་ནོན་པའི་སེམས་ཀྱི་རྟོག་པའི་ཁྱད་པར་གྱིས་རྣམ་པར་བརྟགས་པའི་གཟུགས་ལ་སོགས་པ་སོ་སོར་སྣང་བའི་རྒྱུ་ལས་འབྱུང་ཡང་ཡོད་པ་མ་ཡིན་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་རྒྱུ་ལས་འབྱུང་ཡང་ཡོད་པ་མ་ཡིན་ནོ།
en: Even though they come about from causes, they do not exist. Similarly, all phenomena come about from causes but do not exist.

source: །མེད་དུ་ཟིན་ན་ཇི་ལྟར་ཕ་ལས་བུ་འབྱུང་བ་དང་། ཤིང་ཨ་མྲ་ལ་སོགས་པའི་ས་བོན་ལས་འབྲས་བུ་འབྱུང་བ་བཞིན་དུ་ཇི་ལྟར་རྒྱུ་དང་འདྲ་བར་འགྱུར་ཞེ་ན།
en: Given that they do not exist, how is a son produced from a father, fruit from the pits of the fruit of mango trees and so on—how do results similar to causes come about?

source: དཔེར་ན་བཞིན་ལ་སོགས་པའི་རྒྱུ་སྣང་བར་འགྱུར་བ་ལས། མེ་ལོང་ལ་སོགས་པ་ལ་གཟུགས་བརྙན་དག་འདྲ་བར་དམིགས་ཀྱང་ཡོད་པ་མ་ཡིན་པ་ལྟར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ནོ།
en: To illustrate, just as you apprehend a reflection in a mirror from the appearance of a face and so on that is its cause, even though it does not exist, similarly with all phenomena.

source: །ཇི་ལྟར་ན་བྱེད་པ་འབྱུང་བར་འགྱུར་ཞེ་ན།
en: How do activities come about?

source: དཔེར་ན་སྤྲུལ་པ་རྣམས་ལ་འགྲོ་བ་དང་འོང་བ་ལ་སོགས་པ་ལུས་ཀྱི་ལས་རྣམས་དང་། ངག་གི་ལས་རྣམས་རྣམ་པར་སྣང་ཡང་དེ་ལྟར་ཡོད་པ་མ་ཡིན་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ། །ཡང་ན་མཚན་ཉིད་རྣམ་པ་བརྒྱད་དེ། སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དང་། མཚན་མ་མེད་པའི་མཚན་ཉིད་དང་།
en: Just as magical creations appear to have physical activities—going, coming, and so on—and verbal activities, even though they do not exist, similarly with all phenomena.

source: སྨོན་པ་མེད་པའི་མཚན་ཉིད་དང་། ངོ་བོ་ཉིད་མེད་པའི་མཚན་ཉིད་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་མཚན་ཉིད་དང་། མིག་ཡོར་གྱི་མཚན་ཉིད་དང་། ཀུན་བརྟགས་པའི་མཚན་ཉིད་དང་། གཞན་གྱི་དབང་གི་མཚན་ཉིད་དེ།
en: Alternatively, there are eight marks: the mark of emptiness, the mark of signlessness, the mark of wishlessness, the mark of the absence of an intrinsic nature, the mark of a dependent origination, the mark of an apparition, the mark of a falsely imagined phenomenon, and the mark of a dependent phenomenon.

source: དེ་ལ་སྒྱུ་མའི་གླང་པོ་ཆེ་ལ་སོགས་པ་མེད་པ་ནི་སྟོང་པ་ཉིད་དོ། །སྨིག་རྒྱུ་ལ་སོགས་པ་ལ་ཆུ་ལ་སོགས་པར་ནོར་བ་ནི་མཚན་མ་མེད་པའོ། །ཆུ་ཟླ་ནི་གང་དུ་ཡང་གནས་པ་མེད་པ་སྟེ་སྨོན་པ་མེད་པའོ། །རྨི་ལམ་ནི་ངོ་བོ་ཉིད་མེད་པའོ། །བྲག་ཅ་ནི་ནམ་མཁའ་དང་།
en: Among these, the nonexistence of the illusory elephants and so on is emptiness; a mirage and so on that is mistaken for water and so on is signlessness; a reflection of the moon in water that has no standing anywhere is wishlessness; a dream is the absence of an intrinsic nature; an echo arises dependent on space, mountains, caves, and so on; apparitions are appearances out of the void; reflections in the mirror have a standing in the face alone—they appear as if they are standing in the mirror over there.

source: རི་དང་། ཕུག་ལ་སོགས་པའི་རྐྱེན་ལས་འབྱུང་བ་ཉིད་དོ། །མིག་ཡོར་ནི་མེད་པ་ཉིད་ལས་སྣང་བ་དག་གོ། །གཟུགས་བརྙན་དག་ནི་བཞིན་ལ་གནས་པ་ཁོ་ན་དག་ཡིན་ནོ། །ཕྱི་རོལ་གྱི་མེ་ལོང་ལ་གནས་པ་ལྟར་སྣང་བ་དེ་བཞིན་དུ་ཀུན་བརྟགས་པ་ལ་ཡང་རྣམ་པར་ཤེས་པ་ལས་ཕྱི་རོལ་ན་གནས་པ་བཞིན་དུ་སྣང་ངོ་།
en: Similarly, imaginary phenomena appear as if they are standing over there away from the consciousness.

source: །གཞན་གྱི་དབང་ནི་རྐྱེན་གཞན་གྱི་དབང་ལས་འབྱུང་བ་སྟེ། དཔེར་ན་སྤྲུལ་པ་དག་ནི་འཕྲུལ་བྱེད་པའི་དབང་གིས་བྱུང་བ་བཞིན་དུ་སྦྱར་བར་བྱའོ།
en: Dependent phenomena are produced dependent on conditions, like, as an analogy, magical creations that are produced dependent on the magician. You should construe them like that.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་དང་མོས་པ་དང་།
en: They are skillful in comprehending the thoughts, conduct, and beliefs of all beings and subtle knowledge.

source: ཕྲ་བ་མཁྱེན་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་།
en: This teaches that by means of the concordant cause that is the perfection of knowledge, the sarva­sattva­citta­caritānugata and the dharma­dhātu­praveśa meditative stabilizations are produced.

source: སྤྱོད་པ་རྗེས་སུ་རྟོགས་པ་ཞེས་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སྐྱེ་སྟེ། དེ་ལ་ཏིང་ངེ་འཛིན་སྔ་མས་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པའི་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་པར་གྱུར་ལ། དེ་དག་གི་སེམས་དང་སྤྱོད་པ་དང་མོས་པ་ཐ་དད་པ་རྣམ་པ་སྣ་ཚོགས་པ་རྣམས་སྐད་ཅིག་གཅིག་ལ་ཡེ་ཤེས་གཅིག་གིས་ཁོང་དུ་ཆུད་དེ།
en: With the former of these meditative stabilizations they “comprehend,” with a single act of knowledge and in a single instant, the different “thoughts,” “conduct,” and “beliefs” in all their variety of as many beings as there are included in the category of being, in all world systems all gathered together.

source: ཁོང་དུ་ཆུད་ནས་ཀྱང་དེ་དག་གདུལ་བའི་ཐབས་སྐད་ཅིག་གཅིག་གིས་ཁོང་དུ་ཆུད་དེ། དེ་དག་ལ་དེ་བཞིན་དུ་སྒྲུབ་པ་ཡང་བྱེད་དོ་།
en: Having comprehended them, they understand in a single instant the means to train them and cause them to practice accordingly.
